In [35]:
import pymysql
from sqlalchemy import create_engine, text
import seaborn as sns
conn = create_engine("mysql+pymysql://root:0000@localhost:3306/donga")

In [24]:
gapminder = pd.read_csv("https://raw.githubusercontent.com/OHI-Science/data-science-training/master/data/gapminder.csv")

In [26]:
gapminder = gapminder.iloc[:,:4]

In [53]:
gapminder.country = gapminder.country.str.replace("'","")

In [54]:
data = gapminder.to_dict('records')

In [59]:
create_stmt = """
create table world(
country varchar(100),
year varchar(10),
pop varchar(20),
continent varchar(20));
"""
conn.execute(text(create_stmt))

In [60]:
stmt = "select * from world"
pd.read_sql(stmt,conn)

Empty DataFrame
Columns: [country, year, pop, continent]
Index: []

In [45]:
dt = []
for i in data:
    country = i['country']
    year = i['year']
    pop = i['pop']
    continent = i['continent']
    stmt = f"insert into world(country,year,pop,continent) values('{country}','{year}','{pop}','{continent}')"
    dt.append(stmt)

In [51]:
for row in dt:
    try:
        conn.execute(text(row))
    except:
        pass

In [52]:
pd.read_sql('select * from world',conn)

          country  year         pop continent
0     Afghanistan  1952   8425333.0      Asia
1     Afghanistan  1957   9240934.0      Asia
2     Afghanistan  1962  10267083.0      Asia
3     Afghanistan  1967  11537966.0      Asia
4     Afghanistan  1972  13079460.0      Asia
...           ...   ...         ...       ...
1687     Zimbabwe  1987   9216418.0    Africa
1688     Zimbabwe  1992  10704340.0    Africa
1689     Zimbabwe  1997  11404948.0    Africa
1690     Zimbabwe  2002  11926563.0    Africa
1691     Zimbabwe  2007  12311143.0    Africa

[1692 rows x 4 columns]

In [36]:
create_stmt = """
create table world(
country varchar(100),
year varchar(20),
pop varchar(20),
continent varchar(50)
);
"""
conn.execute(text(create_stmt))

In [39]:
pd.read_sql("select * from world",conn)

Empty DataFrame
Columns: [country, year, pop, continent]
Index: []

In [34]:
stmt = dt[0]
conn.execute(text(stmt))

"insert into world(country,year,pop,continent) values('Afghanistan','1952','8425333.0','Asia')"

In [2]:
protocol = 'mysql+pymysql://'
user = 'root'
password = '0000'
host = 'localhost'
port = '3306'
database = 'donga'

In [9]:
conn_str = protocol+user+':'+password+'@'+host+':'+port+'/'+database
conn_str
conn = create_engine(conn_str)

In [5]:
import pandas as pd

In [10]:
sql_stmt = """
select *
from donga_table;
"""
pd.read_sql(sql_stmt,conn)

    col1   col2
0  test1  test2
1  test3  test4
2  test5  test6